recipes/banana-pancakes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Banana pancakes</title>
<meta name="author" content="James" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content" class="content">
<h1 class="title">Banana pancakes</h1>
<p>
<a href="https://www.yummytoddlerfood.com/vegan-banana-pancakes/">Original link</a>
</p>

<div id="outline-container-org31ed5a2" class="outline-2">
<h2 id="org31ed5a2">Ingredients</h2>
<div class="outline-text-2" id="text-org31ed5a2">
<ul class="org-ul">
<li>1 cup sliced very ripe banana (about 2 bananas)</li>
<li>1 cup plain flour (or buckwheat or whole wheat)</li>
<li>2 tablespoons ground flaxseed</li>
<li>2 teaspoons baking powder</li>
<li>1 teaspoon cinnamon</li>
<li>1/4 teaspoon salt</li>
<li>1 cup nondairy milk</li>
<li>2 tablespoons canola oil or melted coconut oil</li>
<li>1 teaspoon vanilla extract</li>
</ul>
</div>
</div>

<div id="outline-container-orga2adef5" class="outline-2">
<h2 id="orga2adef5">Instructions</h2>
<div class="outline-text-2" id="text-orga2adef5">
<ol class="org-ol">
<li>Mash the banana very smooth with a fork.</li>
<li>Stir together the flour, flaxseed, baking powder, cinnamon, and salt in a medium bowl.</li>
<li>Stir in the banana, milk, oil, and vanilla. Gently combine to make a uniform, thick batter.</li>
<li>Heat a cast-iron or nonstick skillet or griddle over medium heat. Coat with neutral oil. Spoon out ¼ cup of the batter at a time, or less to make smaller pancakes, and spread to an even thickness about 1/2 inch thick. (Add a few slices of banana on top of each if desired.) Let cook about 3 minutes or until the edges are set.</li>
<li>Carefully flip and cook for another 1-2 minutes.</li>
<li>Serve immediately and repeat with the rest of the batter.</li>
<li>Serve with maple syrup, sliced banana, or other desired topping.</li>
</ol>
</div>
</div>
</div>
</body>
</html>
